Repository: 40fingers/SolidCP
Catalog: SolidCP/Sources/SolidCP.WebPortal/DesktopModules/SolidCP/App_LocalResources/WebsitesSSL.ascx.*.resx
Languages: ar_ae

# btnCancelPFXUploadText.Text
source: Cancel Upload
ar_ae: إلغاء الرفع

# btnCancelRequestText.Text
source: Cancel request
ar_ae: إلغاء الطلب

# btnCSR.Text
source: Generate CSR
ar_ae: إنشاء CSR

# btnCSRCancelText.Text
source: Cancel CSR Generation
ar_ae: إلغاء إنشاء جيل CSR

# btnCSRText.Text
source: Generate CSR
ar_ae: إنشاء CSR

# btnDelete.OnClientClick
source: return confirm('Remove SSL from this web site?');
ar_ae: تأكيد الإرجاع ("هل تريد إزالة SSL من موقع الويب هذا؟") ؛

# btnDelete.Text
source: Delete Certificate
ar_ae: حذف الشهادة

# btnDeleteText.Text
source: Delete
ar_ae: حذف

# btnExport.Text
source: Export Certificate
ar_ae: استخراج الشهادة

# btnExportModal.Text
source: Export Certificate
ar_ae: استخراج الشهادة

# btnExportModalText.Text
source: Export
ar_ae: استخراج

# btnExportText.Text
source: Export
ar_ae: استخراج

# btnImport.Text
source: Import Existing Certificate
ar_ae: استيراد الشهادة الحالية

# btnImportText.Text
source: Import
ar_ae: استيراد

# btnInstallCertificate.Text
source: Install Certificate
ar_ae: تثبيت الشهادة

# btnInstallCertificateText.Text
source: Install
ar_ae: تثبيت

# btnInstallConfirm.Text
source: Are you sure? Your current installed certificate will be deleted.
ar_ae: هل أنت واثق؟ سيتم حذف الشهادة المثبتة الحالية الخاصة بك.

# btnInstallPFX.Text
source: Install Certificate
ar_ae: تثبيت الشهادة

# btnInstallPFXText.Text
source: Install
ar_ae: تثبيت

# btnPFXExportCancel.Text
source: Cancel
ar_ae: إلغاء

# btnPFXExportCancelText.Text
source: Cancel
ar_ae: إلغاء

# btnRegenCSR.Text
source: Generate New CSR
ar_ae: إنشاء CSR جديدة

# btnRegenCSRText.Text
source: Generate New CSR
ar_ae: إنشاء CSR جديدة

# btnRenCSR.Text
source: Generate Renewal CSR
ar_ae: توليد تجديد CSR

# btnRenCSRText
source: Generate Renewal CSR
ar_ae: توليد تجديد CSR

# btnRenew.Text
source: Renew Certificate
ar_ae: تجديد الشهادة

# btnRenewText.Text
source: Renew
ar_ae: تجديد

# btnRenew.OnClientClick
source: return confirm('Renew SSL for this web site?');
ar_ae: تأكيد الإرجاع ("تجديد SSL لموقع الويب هذا؟") ؛

# btnShowpnlCSR.Text
source: Generate CSR
ar_ae: إنشاء CSR

# btnShowpnlCSRText.Text
source: Generate CSR
ar_ae: إنشاء CSR

# btnShowUpload.Text
source: Upload Certificate
ar_ae: رفع الشهادة

# btnShowUploadText.Text
source: Upload Certificate
ar_ae: رفع الشهادة

# GenerateCSR.Text
source: Generate CSR
ar_ae: إنشاء CSR

# headerInstalledCertificate.Text
source: Certificate Info
ar_ae: معلومات الشهادة

# headerPFXPassword.Text
source: Enter a password for the PFX
ar_ae: أدخل كلمة مرور لـ PFX

# InstallCSRCertificate.Text
source: Paste your certificate from your CA into to the text area below and click on “Install Certificate” button.
ar_ae: الصق شهادتك من CA في منطقة النص أدناه وانقر على زر "تثبيت الشهادة".

# InstallCSRDescription.Text
source: A CSR for your Website was generated successfully and is shown below. Copy the text below and paste it to a CA to request the certificate.
ar_ae: تم إنشاء CSR لموقع الويب الخاص بك بنجاح وهو موضح أدناه. انسخ النص أدناه والصقه في مرجع مصدق لطلب الشهادة.

# InstallCSRHeading.Text
source: Install Certificate
ar_ae: تثبيت الشهادة

# lblPFXInstallPassword.Text
source: PFX Password
ar_ae: كلمة مرور PFX

# PfxPassword.Text
source: Password:
ar_ae: كلمة المرور:

# PfxPasswordConfirmation.Text
source: Confirm:
ar_ae: تأكيد:

# SelectCertType.Text
source: Select Certificate Type:
ar_ae: حدد نوع الشهادة:

# sslBitLength.Text
source: Bit Length:
ar_ae: طول البت:

# sslCertificate.Text
source: Certificate
ar_ae: شهادة

# sslCity.Text
source: City/Locality:
ar_ae: المدينة / المنطقة:

# sslCountry.Text
source: Country:
ar_ae: الدولة:

# sslDomain.Text
source: Domain:
ar_ae: النطاقات

# sslExpiry.Text
source: Expiration Date:
ar_ae: تاريخ انتهاء الصلاحية:

# SSLGenereateRenewal.HeaderText
source: Generate Renewal Request
ar_ae: إنشاء طلب التجديد

# SSLImportDescription.Text
source: A SSL certificate has been detected on the website that is not managed by SolidCP. Click the button below to import the certificate settings
ar_ae: تم الكشف عن شهادة SSL على موقع الويب الذي لا تتم إدارته بواسطة SolidCP. انقر فوق الزر أدناه لاستيراد إعدادات الشهادة

# SSLImportHeading.Text
source: Existing certificate detected
ar_ae: تم الكشف عن شهادة حالية

# sslIncludewww.Text
source: include www.
ar_ae: تشمل www.

# SSLInstalledNewDescription.Text
source: A certificate is already installed on this website. You can create a new request or upload a new certificate, however the current certificate will be removed. If you need to renew the current certificate, click the renew button on the Installed Certificate tab.
ar_ae: تم تثبيت شهادة بالفعل على هذا الموقع. يمكنك إنشاء طلب جديد أو تحميل شهادة جديدة ، ومع ذلك ستتم إزالة الشهادة الحالية. إذا كنت بحاجة إلى تجديد الشهادة الحالية ، فانقر فوق الزر تجديد في علامة التبويب الشهادة المثبتة.

# SSLInstalledNewHeading.Text
source: Install New certificate
ar_ae: تثبيت شهادة جديدة

# SSLNotInstalledHeading.Text
source: Install normal Certificate
ar_ae: تثبيت الشهادة العادية

# LENotInstalledHeading.Text
source: Install (free) Lets Encrypt Certificate
ar_ae: تثبيت (مجاني) يتيح تشفير الشهادة

# SSLNotInstalledDescription.Text
source: Install an Existing certificate by uploading your PFX, or create a certificate request to supply to your certificate provider
ar_ae: قم بتثبيت شهادة موجودة عن طريق تحميل PFX الخاص بك ، أو إنشاء طلب شهادة لتزويده بموفر الشهادة الخاص بك

# LENotInstalledDescription.Text
source: Automatically request and install a Lets Encrypt certificate. It's functionality and support are the same as a paid certificate.
ar_ae: طلب شهادة Lets Encrypt وتثبيتها تلقائيًا. وظائفها ودعمها هما نفس الشهادة المدفوعة.

# sslOrganization.Text
source: Organization:
ar_ae: منظمة:

# sslOrganizationUnit.Text
source: Organization Unit:
ar_ae: وحدة التنظيم:

# sslState.Text
source: State/Province:
ar_ae: الولاية / المقاطعة:

# sslWildcard.Text
source: Wildcard certificate (covers all sub-domains)
ar_ae: شهادة Wildcard (تغطي جميع النطاقات الفرعية)

# tabInstalled.Text
source: Installed Certificate
ar_ae: الشهادة المثبتة

# tabNewCertificate.HeaderText
source: New Certificate
ar_ae: شهادة جديدة

# tabPendingCertificate.HeaderText
source: Pending Request
ar_ae: طلب معلق

# valtxtPFXPassConfirm.ErrorMessage
source: Passwords do not match
ar_ae: كلمة المرور غير مطابقة

# LEInstallText.Text
source: Install Certificate
ar_ae: تثبيت الشهادة
